#define DL_ASSTEXT 160
#define DL_OBJTEXT 500 /*РґР»РёРЅР° РѕР±'РµРєС‚РЅ. С‚РµРєСЃС‚Р°   */
#define NSYM 20        /*СЂР°Р·РјРµСЂ С‚Р°Р±Р».СЃРёРјРІРѕР»РѕРІ    */
#define NPOP 6         /*СЂР°Р·РјРµСЂ С‚Р°Р±Р».РїСЃРµРІРґРѕРѕРїРµСЂ. */
#define NOP 11         /*СЂР°Р·РјРµСЂ С‚Р°Р±Р».РѕРїРµСЂР°С†РёР№    */
#include <string.h>    /*РІРєР».СЃС‚СЂРѕРєРѕРІС‹Рµ РїРѕРґРїСЂРѕРіСЂ. */
#include <stdlib.h>    /*РІРєР».РїРѕРґРїСЂРѕРіСЂ.РїСЂРµРѕР±СЂ.РґР°РЅРЅ*/
#include <stdio.h>     /*РІРєР».РїРѕРґРїСЂ.СЃС‚Р°РЅРґ.РІРІ/РІС‹РІ  */
#include <ctype.h>     /*РІРєР».РїРѕРґРїСЂ.РєР»Р°СЃСЃРёС„.СЃРёРјРІ. */
#include <stdint.h>
/*
******* Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ СЃС‚Р°С‚РёС‡РµСЃРєРёС… СЂР°Р±РѕС‡РёС… РїРµСЂРµРјРµРЅРЅС‹С…
*/

char NFIL[30] = "\x0";

unsigned char PRNMET = 'N'; /*РёРЅРґРёРєР°С‚РѕСЂ РѕР±РЅР°СЂСѓР¶.РјРµС‚РєРё */
int I3;                     /*СЃС‡РµС‚С‡РёРє С†РёРєР»Р°           */

/*
***** Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ РїСЂРѕС‚РѕС‚РёРїРѕРІ РѕР±СЂР°С‰РµРЅРёР№ Рє РїРѕРґРїСЂРѕРіСЂР°РјРјР°Рј 1-РіРѕ РїСЂРѕСЃРјРѕС‚СЂР°
*/

/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FDC(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DC    */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FDS(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DS    */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FEND(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.END   */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FEQU(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.EQU   */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FSTART(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.START */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FUSING(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.USING */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FRR(); /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RR-С„РѕСЂРј. */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int FRX(); /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RX-С„РѕСЂРј. */
/*..........................................................................*/

/*
***** Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ РїСЂРѕС‚РѕС‚РёРїРѕРІ РѕР±СЂР°С‰РµРЅРёР№ Рє РїРѕРґРїСЂРѕРіСЂР°РјРјР°Рј 2-РіРѕ РїСЂРѕСЃРјРѕС‚СЂР°
*/

/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SDC(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DC    */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SDS(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DS    */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SEND(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.END   */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SEQU(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.EQU   */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SSTART(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.START */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SUSING(); /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.USING */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SRR(); /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RR-С„РѕСЂРј. */
/*..........................................................................*/
/*Рї СЂ Рѕ С‚ Рѕ С‚ Рё Рї  РѕР±СЂР°С‰.Рє*/
int SRX(); /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RX-С„РѕСЂРј. */
           /*..........................................................................*/

/*
******* Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ С‚Р°Р±Р»РёС† Р±Р°Р·С‹ РґР°РЅРЅС‹С… РєРѕРјРїРёР»СЏС‚РѕСЂР°
*/

/*
******* РћР‘'РЇР’Р›Р•РќРР• СЃС‚СЂСѓРєС‚СѓСЂС‹ СЃС‚СЂРѕРєРё (РєР°СЂС‚С‹) РёСЃС…РѕРґРЅРѕРіРѕ С‚РµРєСЃС‚Р°
*/

struct ASSKARTA /*СЃС‚СЂСѓРєС‚.РєР°СЂС‚С‹ РђРЎРЎР•РњР‘Р›Р•Р Рђ */
{
  unsigned char METKA[8];    /*РїРѕР»Рµ РјРµС‚РєРё              */
  unsigned char PROBEL1[1];  /*РїСЂРѕР±РµР»-СЂР°Р·РґРµР»РёС‚РµР»СЊ      */
  unsigned char OPERAC[5];   /*РїРѕР»Рµ РѕРїРµСЂР°С†РёРё           */
  unsigned char PROBEL2[1];  /*РїСЂРѕР±РµР»-СЂР°Р·РґРµР»РёС‚РµР»СЊ      */
  unsigned char OPERAND[12]; /*РїРѕР»Рµ РѕРїРµСЂР°РЅРґР°           */
  unsigned char PROBEL3[1];  /*РїСЂРѕР±РµР» СЂР°Р·РґРµР»РёС‚РµР»СЊ      */
  unsigned char COMM[52];    /*РїРѕР»Рµ РєРѕРјРјРµРЅС‚Р°СЂРёСЏ        */
};

/*
******* РќРђР›РћР–Р•РќРР• СЃС‚СЂСѓРєС‚СѓСЂС‹ РєР°СЂС‚С‹ РёСЃС…. С‚РµРєСЃС‚Р° РЅР° РІС…РѕРґРЅРѕР№ Р±СѓС„РµСЂ
*/

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  unsigned char BUFCARD[80];      /*Р±СѓС„РµСЂ РєР°СЂС‚С‹.РёСЃС….С‚РµРєСЃС‚Р°  */
  struct ASSKARTA STRUCT_BUFCARD; /*РЅР°Р»РѕР¶РµРЅРёРµ С€Р°Р±Р».РЅР° Р±СѓС„РµСЂ */
} TEK_ISX_KARTA;

/*
***** РЎР§Р•РўР§РРљ РѕС‚РЅРѕСЃРёС‚РµР»СЊРЅРѕРіРѕ Р°РґСЂРµСЃР° (СЃРјРµС‰РµС€РёСЏ РѕС‚РЅРѕСЃРёС‚РµР»СЊРЅРѕ Р±Р°Р·С‹ )
*/

int CHADR; /*СЃС‡РµС‚С‡РёРє                 */

/*
***** РўРђР‘Р›РР¦Рђ СЃРёРјРІРѕР»РѕРІ
*/

int ITSYM = -1; /*РёРЅРґ.СЃРІРѕР±.СЃС‚СЂ. С‚Р°Р±Р».СЃРёРјРІ.*/
struct TSYM     /*СЃС‚СЂСѓРєС‚.СЃС‚СЂРѕРєРё С‚Р°Р±Р».СЃРёРјРІ.*/
{
  unsigned char IMSYM[8]; /*РёРјСЏ СЃРёРјРІРѕР»Р°             */
  int ZNSYM;              /*Р·РЅР°С‡РµРЅРёРµ СЃРёРјРІРѕР»Р°        */
  int DLSYM;              /*РґР»РёРЅР° СЃРёРјРІРѕР»Р°           */
  char PRPER;             /*РїСЂРёР·РЅР°Рє РїРµСЂРµРјРµС‰РµРЅРёСЏ     */
};

struct TSYM T_SYM[NSYM]; /*РѕРїСЂРµРґРµР»РµРЅРёРµ С‚Р°Р±Р».СЃРёРјРІ.  */

/*
***** РўРђР‘Р›РР¦Рђ РјР°С€РёРЅРЅС‹С… РѕРїРµСЂР°С†РёР№
*/

struct TMOP /*СЃС‚СЂСѓРєС‚.СЃС‚СЂ.С‚Р°Р±Р».РјР°С€.РѕРїРµСЂ*/
{
  unsigned char MNCOP[5]; /*РјРЅРµРјРѕРєРѕРґ РѕРїРµСЂР°С†РёРё       */
  unsigned char CODOP;    /*РјР°С€РёРЅРЅС‹Р№ РєРѕРґ РѕРїРµСЂР°С†РёРё   */
  unsigned char DLOP;     /*РґР»РёРЅР° РѕРїРµСЂР°С†РёРё РІ Р±Р°Р№С‚Р°С… */
  int (*BXPROG)();        /*СѓРєР°Р·Р°С‚РµР»СЊ РЅР° РїРѕРґРїСЂ.РѕР±СЂР°Р±*/
} T_MOP[NOP] =            /*РѕР±'СЏРІР»РµРЅРёРµ С‚Р°Р±Р».РјР°С€.РѕРїРµСЂ*/
    {
        {{'B', 'A', 'L', 'R', ' '}, '\x05', 2, FRR}, /*РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ           */
        {{'B', 'C', 'R', ' ', ' '}, '\x07', 2, FRR}, /*СЃС‚СЂРѕРє                   */
        {{'S', 'T', ' ', ' ', ' '}, '\x50', 4, FRX}, /*С‚Р°Р±Р»РёС†С‹                 */
        {{'L', ' ', ' ', ' ', ' '}, '\x58', 4, FRX}, /*РјР°С€РёРЅРЅС‹С…                */
        {{'A', ' ', ' ', ' ', ' '}, '\x5A', 4, FRX}, /*РѕРїРµСЂР°С†РёР№                */
        {{'S', ' ', ' ', ' ', ' '}, '\x5B', 4, FRX}, /*                        */
        {{'S', 'T', 'H', ' ', ' '}, '\x40', 4, FRX},
        {{'L', 'H', ' ', ' ', ' '}, '\x48', 4, FRX},
        {{'C', 'H', ' ', ' ', ' '}, '\x49', 4, FRX},
        {{'A', 'H', ' ', ' ', ' '}, '\x4A', 4, FRX},
        {{'B', 'C', ' ', ' ', ' '}, '\x47', 4, FRX},
};

/*
***** РўРђР‘Р›РР¦Рђ РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёР№
*/

struct TPOP /*СЃС‚СЂСѓРєС‚.СЃС‚СЂ.С‚Р°Р±Р».РїСЃ.РѕРїeСЂ.*/
{
  unsigned char MNCPOP[5]; /*РјРЅРµРјРѕРєРѕРґ РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёРё */
  int (*BXPROG)();         /*СѓРєР°Р·Р°С‚РµР»СЊ РЅР° РїРѕРґРїСЂ.РѕР±СЂР°Р±*/
} T_POP[NPOP] =            /*РѕР±'СЏРІР»РµРЅРёРµ С‚Р°Р±Р».РїСЃРµРІРґРѕРѕРї*/
    {
        {{'D', 'C', ' ', ' ', ' '}, FDC},    /*РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ           */
        {{'D', 'S', ' ', ' ', ' '}, FDS},    /*СЃС‚СЂРѕРє                   */
        {{'E', 'N', 'D', ' ', ' '}, FEND},   /*С‚Р°Р±Р»РёС†С‹                 */
        {{'E', 'Q', 'U', ' ', ' '}, FEQU},   /*РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёР№          */
        {{'S', 'T', 'A', 'R', 'T'}, FSTART}, /*                        */
        {{'U', 'S', 'I', 'N', 'G'}, FUSING}  /*                        */
};

/*
***** РўРђР‘Р›РР¦Рђ Р±Р°Р·РѕРІС‹С… СЂРµРіРёСЃС‚СЂРѕРІ
*/

struct TBASR /*СЃС‚СЂСѓРєС‚.СЃС‚СЂ.С‚Р°Р±Р».Р±Р°Р·.СЂРµРі.*/
{
  int SMESH;   /*                        */
  char PRDOST; /*                        */
} T_BASR[15] = /*                        */
    {
        {0x00, 'N'}, /*РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ           */
        {0x00, 'N'}, /*СЃС‚СЂРѕРє                   */
        {0x00, 'N'}, /*С‚Р°Р±Р»РёС†С‹                 */
        {0x00, 'N'}, /*Р±Р°Р·РѕРІС‹С…                 */
        {0x00, 'N'}, /*СЂРµРіРёСЃС‚СЂРѕРІ               */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}, /*                        */
        {0x00, 'N'}  /*                        */
};

/*
***** Р‘ Р› Рћ Рљ   РѕР±'СЏРІР»РµРЅРёСЏ РјР°СЃСЃРёРІР° СЃ РѕР±'РµРєС‚РЅС‹Рј С‚РµРєСЃС‚РѕРј
*/

unsigned char OBJTEXT[DL_OBJTEXT][80]; /*РјР°СЃСЃРёРІ РѕР±'РµРєС‚РЅС‹С… РєР°СЂС‚   */
int ITCARD = 0;                        /*СѓРєР°Р·Р°С‚РµР»СЊ С‚РµРєСѓС‰.РєР°СЂС‚С‹   */

struct OPRR /*СЃС‚СЂСѓРєС‚.Р±СѓС„.РѕРїРµСЂ.С„РѕСЂРј.RR */
{
  unsigned char OP;   /*РєРѕРґ РѕРїРµСЂР°С†РёРё            */
  unsigned char R1R2; /*R1 - РїРµСЂРІС‹Р№ РѕРїРµСЂР°РЅРґ     */
                      /*R2 - РІС‚РѕСЂРѕР№ РѕРїРµСЂР°РЅРґ     */
};

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  unsigned char BUF_OP_RR[2]; /*РѕСЂРµРґРµР»РёС‚СЊ Р±СѓС„РµСЂ         */
  struct OPRR OP_RR;          /*СЃС‚СЂСѓРєС‚СѓСЂРёСЂРѕРІР°С‚СЊ РµРіРѕ     */
} RR;

struct OPRX /*СЃС‚СЂСѓРєС‚.Р±СѓС„.РѕРїРµСЂ.С„РѕСЂРј.RX */
{
  unsigned char OP;   /*РєРѕРґ РѕРїРµСЂР°С†РёРё            */
  unsigned char R1X2; /*R1 - РїРµСЂРІС‹Р№ РѕРїРµСЂР°РЅРґ     */
  short B2D2;         /*X2 - РІС‚РѕСЂРѕР№ РѕРїРµСЂР°РЅРґ     */
                      //    int B2D2;                                     /*X2 - РІС‚РѕСЂРѕР№ РѕРїРµСЂР°РЅРґ     */
                      /*B2 - Р±Р°Р·.СЂРµРі.2-РіРѕ РѕРї-РґР° */
                      /*D2 - СЃРјРµС‰РµРЅ.РѕС‚РЅРѕСЃРёС‚.Р±Р°Р·С‹*/
};

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  unsigned char BUF_OP_RX[4]; /*РѕСЂРµРґРµР»РёС‚СЊ Р±СѓС„РµСЂ         */
  struct OPRX OP_RX;          /*СЃС‚СЂСѓРєС‚СѓСЂРёСЂРѕРІР°С‚СЊ РµРіРѕ     */
} RX;

struct STR_BUF_ESD /*СЃС‚СЂСѓРєС‚.Р±СѓС„РµСЂР° РєР°СЂС‚С‹ ESD */
{
  unsigned char POLE1;      /*РјРµСЃС‚Рѕ РґР»СЏ РєРѕРґР° 0x02     */
  unsigned char POLE2[3];   /*РїРѕР»Рµ С‚РёРїР° РѕР±'РµРєС‚РЅ.РєР°СЂС‚С‹ */
  unsigned char POLE3[6];   /*РїСЂРѕР±РµР»С‹                 */
  unsigned char POLE31[2];  /*РґР»РёРЅР° РґР°РЅРЅС‹С… РЅР° РєР°СЂС‚Рµ   */
  unsigned char POLE32[2];  /*РїСЂРѕР±РµР»С‹                 */
  unsigned char POLE4[2];   /*РІРЅСѓС‚СЂ.РёРґ-СЂ РёРјРµРЅРё РїСЂРѕРіСЂ. */
  unsigned char IMPR[8];    /*РёРјСЏ РїСЂРѕРіСЂР°РјРјС‹           */
  unsigned char POLE6;      /*РєРѕРґ С‚РёРїР° ESD-РёРјРµРЅРё      */
  unsigned char ADPRG[3];   /*РѕС‚РЅРѕСЃРёС‚.Р°РґСЂРµСЃ РїСЂРѕРіСЂР°РјРјС‹ */
  unsigned char POLE8;      /*РїСЂРѕР±РµР»С‹                 */
  unsigned char DLPRG[3];   /*РґР»РёРЅР° РїСЂРѕРіСЂР°РјРјС‹         */
  unsigned char POLE10[40]; /*РїСЂРѕР±РµР»С‹                 */
  unsigned char POLE11[8];  /*РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅРѕРµ РїРѕР»Рµ  */
};

struct STR_BUF_TXT /*СЃС‚СЂСѓРєС‚.Р±СѓС„РµСЂР° РєР°СЂС‚С‹ TXT */
{
  unsigned char POLE1;     /*РјРµСЃС‚Рѕ РґР»СЏ РєРѕРґР° 0x02     */
  unsigned char POLE2[3];  /*РїРѕР»Рµ С‚РёРїР° РѕР±'РµРєС‚РЅ.РєР°СЂС‚С‹ */
  unsigned char POLE3;     /*РїСЂРѕР±РµР»                  */
  unsigned char ADOP[3];   /*РѕС‚РЅРѕСЃРёС‚.Р°РґСЂРµСЃ РѕРїСЂРµР°С†РёРё  */
  unsigned char POLE5[2];  /*РїСЂРѕР±РµР»С‹                 */
  unsigned char DLNOP[2];  /*РґР»РёРЅР° РѕРїРµСЂР°С†РёРё          */
  unsigned char POLE7[2];  /*РїСЂРѕР±РµР»С‹                 */
  unsigned char POLE71[2]; /*РІРЅСѓС‚СЂРµРЅРЅРёР№ РёРґРµРЅС‚.РїСЂРѕРіСЂ. */
  unsigned char OPER[56];  /*С‚РµР»Рѕ РѕРїРµСЂР°С†РёРё           */
  unsigned char POLE9[8];  /*РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅРѕРµ РїРѕР»Рµ  */
};

struct STR_BUF_END /*СЃС‚СЂСѓРєС‚.Р±СѓС„РµСЂР° РєР°СЂС‚С‹ END */
{
  unsigned char POLE1;     /*РјРµСЃС‚Рѕ РґР»СЏ РєРѕРґР° 0x02     */
  unsigned char POLE2[3];  /*РїРѕР»Рµ С‚РёРїР° РѕР±'РµРєС‚РЅ.РєР°СЂС‚С‹ */
  unsigned char POLE3[68]; /*РїСЂРѕР±РµР»С‹                 */
  unsigned char POLE9[8];  /*РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅРѕРµ РїРѕР»Рµ  */
};

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  struct STR_BUF_ESD STR_ESD; /*СЃС‚СЂСѓРєС‚СѓСЂР° Р±СѓС„РµСЂР°        */
  unsigned char BUF_ESD[80];  /*Р±СѓС„РµСЂ РєР°СЂС‚С‹ ESD         */
} ESD;

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  struct STR_BUF_TXT STR_TXT; /*СЃС‚СЂСѓРєС‚СѓСЂР° Р±СѓС„РµСЂР°        */
  unsigned char BUF_TXT[80];  /*Р±СѓС„РµСЂ РєР°СЂС‚С‹ TXT         */
} TXT;

union /*РѕРїСЂРµРґРµР»РёС‚СЊ РѕР±'РµРґРёРЅРµРЅРёРµ  */
{
  struct STR_BUF_END STR_END; /*СЃС‚СЂСѓРєС‚СѓСЂР° Р±СѓС„РµСЂР°        */
  unsigned char BUF_END[80];  /*Р±СѓС„РµСЂ РєР°СЂС‚С‹ ESD         */
} END;

/*
******* Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ РїРѕРґРїСЂРѕРіСЂР°РјРј, РёСЃРїРѕР»СЊР·СѓРµРјС‹С… РїСЂРё 1-РѕРј РїСЂРѕСЃРјРѕС‚СЂРµ
*/


int FDC()                                         /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DC    */
{
    if (PRNMET == 'Y')                            /*РµСЃР»Рё РїСЃРµРІРґРѕРѕРї.DC РїРѕРјРµС‡.,*/
    {                                              /*С‚Рѕ:                     */
        if                                            /* РµСЃР»Рё РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёСЏ DC */
            (                                            /* РѕРїСЂРµРґРµР»СЏРµС‚ РєРѕРЅСЃС‚Р°РЅС‚Сѓ   */
                TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'F'/* С‚РёРїР° F, С‚Рѕ РІС‹РїРѕР»РЅРёС‚СЊ   */
                )                                            /* СЃР»РµРґСѓСЋС‰РµРµ:             */
        {
            T_SYM[ITSYM].DLSYM = 4;                     /*  СѓСЃС‚.РґР»РёРЅСѓ СЃРёРјРІ. =  4, */
            T_SYM[ITSYM].PRPER = 'R';                   /*  Р°,РїСЂРёР·РЅ.РїРµСЂРµРјРµСЃС‚.='R' */
            if (CHADR % 4)                            /*  Рё, РµСЃР»Рё CHADR РЅРµ СѓРєР°Р·.*/
            {                                          /*  РЅР° РіСЂР°РЅРёС†Сѓ СЃР»РѕРІР°, С‚Рѕ: */
                CHADR = (CHADR / 4 + 1) * 4;               /*   СѓСЃС‚.CHADR РЅР° РіСЂ.СЃР». Рё*/
                T_SYM[ITSYM].ZNSYM = CHADR;               /*   Р·Р°РїРѕРјРЅ. РІ С‚Р°Р±Р».СЃРёРјРІ. */
            }
            PRNMET = 'N';
            CHADR = CHADR + 4;                              /*  Р·Р°РЅСѓР»РёС‚СЊ PRNMET Р·РЅ.'N'*/
        }
        else if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'H')
        {
            T_SYM[ITSYM].DLSYM = 2;
            T_SYM[ITSYM].PRPER = 'R';
            PRNMET = 'N';
            CHADR = CHADR + 2;
        }

        else
            return (1);                                  /* РёРЅР°С‡Рµ РІС‹С…РѕРґ РїРѕ РѕС€РёР±РєРµ  */
    }
    else                                            /*РµСЃР»Рё Р¶Рµ РїСЃРµРІРґРѕРѕРї.РЅРµРїРѕРјРµС‡*/
        if (CHADR % 4)                               /*Рё CHADR РЅРµ РєСЂР°С‚РµРЅ 4,С‚Рѕ: */
            CHADR = (CHADR / 4 + 1) * 4;                   /* СѓСЃС‚Р°РЅРѕРІ.CHADR РЅР° РіСЂ.СЃР».*/

          //CHADR = CHADR + 4;                              /*СѓРІРµР»РёС‡.CHADR РЅР° 4 Рё     */
    return (0);                                     /*СѓСЃРїРµС€РЅРѕ Р·Р°РІРµСЂС€РёС‚СЊ РїРѕРґРїСЂ.*/
}
/*..........................................................................*/
int FDS()                                         /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DS    */
{
    if (PRNMET == 'Y')                            /*РµСЃР»Рё РїСЃРµРІРґРѕРѕРї.DC РїРѕРјРµС‡.,*/
    {                                              /*С‚Рѕ:                     */
        if                                            /* РµСЃР»Рё РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёСЏ DC */
            (                                            /* РѕРїСЂРµРґРµР»СЏРµС‚ РєРѕРЅСЃС‚Р°РЅС‚Сѓ   */
                TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'F'/* С‚РёРїР° F, С‚Рѕ РІС‹РїРѕР»РЅРёС‚СЊ   */
                )                                            /* СЃР»РµРґСѓСЋС‰РµРµ:             */
        {
            T_SYM[ITSYM].DLSYM = 4;                     /*  СѓСЃС‚.РґР»РёРЅСѓ СЃРёРјРІ. =  4, */
            T_SYM[ITSYM].PRPER = 'R';                   /*  Р°,РїСЂРёР·РЅ.РїРµСЂРµРјРµСЃС‚.='R' */
            if (CHADR % 4)                            /*  Рё, РµСЃР»Рё CHADR РЅРµ СѓРєР°Р·.*/
            {                                          /*  РЅР° РіСЂР°РЅРёС†Сѓ СЃР»РѕРІР°, С‚Рѕ: */
                CHADR = (CHADR / 4 + 1) * 4;               /*   СѓСЃС‚.CHADR РЅР° РіСЂ.СЃР». Рё*/
                T_SYM[ITSYM].ZNSYM = CHADR;               /*   Р·Р°РїРѕРјРЅ. РІ С‚Р°Р±Р».СЃРёРјРІ. */
            }
            PRNMET = 'N';
            CHADR = CHADR + 4;                              /*  Р·Р°РЅСѓР»РёС‚СЊ PRNMET Р·РЅ.'N'*/
        }
        else if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'H')
        {
            T_SYM[ITSYM].DLSYM = 2;
            T_SYM[ITSYM].PRPER = 'R';
            PRNMET = 'N';
            CHADR = CHADR + 2;
        }

        else
            return (1);                                  /* РёРЅР°С‡Рµ РІС‹С…РѕРґ РїРѕ РѕС€РёР±РєРµ  */
    }
    else                                            /*РµСЃР»Рё Р¶Рµ РїСЃРµРІРґРѕРѕРї.РЅРµРїРѕРјРµС‡*/
        if (CHADR % 4)                               /*Рё CHADR РЅРµ РєСЂР°С‚РµРЅ 4,С‚Рѕ: */
            CHADR = (CHADR / 4 + 1) * 4;                   /* СѓСЃС‚Р°РЅРѕРІ.CHADR РЅР° РіСЂ.СЃР».*/

          //CHADR = CHADR + 4;                              /*СѓРІРµР»РёС‡.CHADR РЅР° 4 Рё     */
    return (0);                                     /*СѓСЃРїРµС€РЅРѕ Р·Р°РІРµСЂС€РёС‚СЊ РїРѕРґРїСЂ.*/
}
/*..........................................................................*/
int FEND() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.END   */
{
  return (100); /*РІС‹С…РѕРґ СЃ РїСЂРёР·РЅ.РєРѕРЅС†Р° 1-РіРѕ*/
                /*РїСЂРѕСЃРјРѕС‚СЂР°               */
}
/*..........................................................................*/
int FEQU() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.EQU   */
{
  if                                                  /*РµСЃР»Рё РІ РѕРїРµСЂР°РЅРґРµ         */
      (                                               /*РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёРё DC       */
       TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == '*' /*РёСЃРїРѕР»СЊР·РѕРІР°РЅ СЃРёРјРІ. '*',  */
       )                                              /*С‚Рѕ                      */
  {                                                   /* Р·Р°РїРѕРјРЅРёС‚СЊ РІ С‚Р°Р±Р».СЃРёРјРІ.:*/
    T_SYM[ITSYM].ZNSYM = CHADR;                       /*  CHADR РІ РїРѕР»Рµ ZNSYM,   */
    T_SYM[ITSYM].DLSYM = 1;                           /*  1 РІ РїРѕР»Рµ DLSYM,       */
    T_SYM[ITSYM].PRPER = 'R';                         /*  'R' РІ РїРѕРѕР»Рµ PRPER     */
  }
  else                        /*РёРЅР°С‡Рµ Р·Р°РїРѕРјРЅ.РІ С‚Р°Р±Р».СЃРёРјРІ*/
  {                           /* Р·РЅР°С‡РµРЅРёРµ РѕРї-РЅРґР° РїСЃ.РѕРї. */
    T_SYM[ITSYM].ZNSYM = atoi(/* DC РІ РїРѕР»Рµ ZNSYM,       */
                              (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND);
    T_SYM[ITSYM].DLSYM = 1;   /* 1 РІ РїРѕР»Рµ DLSYM,        */
    T_SYM[ITSYM].PRPER = 'A'; /* 'A' РІ РїРѕР»Рµ PRPER       */
  }
  PRNMET = 'N'; /*Р·Р°РЅСѓР».PRNMET Р·РЅР°С‡РµРЅ.'N' */
  return (0);   /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂ.  */
}
/*..........................................................................*/
int FSTART() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.START */
{            /*CHADR СѓСЃС‚Р°РЅРѕРІРёС‚СЊ СЂР°РІРЅС‹Рј */
  CHADR =    /*Р·РЅР°С‡РµРЅРёСЋ РѕРїРµСЂР°РЅРґР°       */
      atoi(
          (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND /*РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёРё START Рё, */
      );
  if (CHADR % 8)                       /*РµСЃР»Рё СЌС‚Рѕ Р·РЅР°С‡РµРЅРёРµ РЅРµ    */
  {                                    /*РєСЂР°С‚РЅРѕ 8, С‚Рѕ СЃРґРµР»Р°С‚СЊ РµРіРѕ*/
    CHADR = (CHADR + (8 - CHADR % 8)); /*РєСЂР°С‚РЅС‹Рј                 */
  } /*Р·Р°РїРѕРјРЅРёС‚СЊ РІ С‚Р°Р±Р».СЃРёРјРІ.: */
  T_SYM[ITSYM].ZNSYM = CHADR; /* CHADR РІ РїРѕР»Рµ ZNSYM,    */
  T_SYM[ITSYM].DLSYM = 1;     /* 1 РІ РїРѕР»Рµ DLSYM,        */
  T_SYM[ITSYM].PRPER = 'R';   /* 'R' РІ РїРѕР»Рµ PRPER       */
  PRNMET = 'N';               /*Р·Р°РЅСѓР».PRNMET Р·РЅР°С‡РµРЅ.'N' */
  return (0);                 /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂРѕРіСЂ*/
}
/*..........................................................................*/
int FUSING() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.USING */
{
  return (0); /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂРѕРіСЂ*/
}
/*..........................................................................*/
int FRR() /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RR-С„РѕСЂРј. */
{
  CHADR = CHADR + 2;          /*СѓРІРµР»РёС‡РёС‚СЊ СЃС‡.Р°РґСЂ. РЅР° 2  */
  if (PRNMET == 'Y')          /*РµСЃР»Рё СЂР°РЅРµРµ РѕР±РЅР°СЂ.РјРµС‚РєР°, */
  {                           /*С‚Рѕ РІ С‚Р°Р±Р». СЃРёРјРІРѕР»РѕРІ:    */
    T_SYM[ITSYM].DLSYM = 2;   /*Р·Р°РїРѕРјРЅРёС‚СЊ РґР»РёРЅСѓ РјР°С€.РѕРїРµСЂ*/
    T_SYM[ITSYM].PRPER = 'R'; /*Рё СѓСЃС‚Р°РЅРѕРІРёС‚СЊ РїСЂРёР·РЅ.РїРµСЂРµРј*/
  }
  return (0); /*РІС‹Р№С‚Рё РёР· РїРѕРґРїСЂРѕРіСЂР°РјРјС‹   */
}
/*..........................................................................*/
int FRX() /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RX-С„РѕСЂРј. */
{
  CHADR = CHADR + 4;          /*СѓРІРµР»РёС‡РёС‚СЊ СЃС‡.Р°РґСЂ. РЅР° 4  */
  if (PRNMET == 'Y')          /*РµСЃР»Рё СЂР°РЅРµРµ РѕР±РЅР°СЂ.РјРµС‚РєР°, */
  {                           /*С‚Рѕ РІ С‚Р°Р±Р». СЃРёРјРІРѕР»РѕРІ:    */
    T_SYM[ITSYM].DLSYM = 4;   /*Р·Р°РїРѕРјРЅРёС‚СЊ РґР»РёРЅСѓ РјР°С€.РѕРїРµСЂ*/
    T_SYM[ITSYM].PRPER = 'R'; /*Рё СѓСЃС‚Р°РЅРѕРІРёС‚СЊ РїСЂРёР·РЅ.РїРµСЂРµРј*/
  }
  return (0); /*РІС‹Р№С‚Рё РёР· РїРѕРґРїСЂРѕРіСЂР°РјРјС‹   */
}
/*..........................................................................*/

/*
******* Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ РїРѕРґРїСЂРѕРіСЂР°РјРј, РёСЃРїРѕР»СЊР·СѓРµРјС‹С… РїСЂРё 2-РѕРј РїСЂРѕСЃРјРѕС‚СЂРµ
*/

void STXT(int ARG) /*РїРѕРґРїСЂ.С„РѕСЂРјРёСЂ.TXT-РєР°СЂС‚С‹  */
{
  char *PTR; /*СЂР°Р±РѕС‡.РїРµСЂРµРјРµРЅРЅР°СЏ-СѓРєР°Р·Р°С‚.*/

  PTR = (char *)&CHADR;             /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РїРѕР»СЏ ADOP  */
  TXT.STR_TXT.ADOP[2] = *PTR;       /*TXT-РєР°СЂС‚С‹ РІ С„РѕСЂРјР°С‚Рµ     */
  TXT.STR_TXT.ADOP[1] = *(PTR + 1); /*РґРІРѕРёС‡РЅРѕРіРѕ С†РµР»РѕРіРѕ        */
  TXT.STR_TXT.ADOP[0] = '\x00';     /*РІ СЃРѕРіР»Р°С€РµРЅРёСЏС… Р•РЎ Р­Р’Рњ    */

  if (ARG == 2) /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РїРѕР»СЏ OPER  */
  {
    memset(TXT.STR_TXT.OPER, 64, 4);
    memcpy(TXT.STR_TXT.OPER, RR.BUF_OP_RR, 2); /* РґР»СЏ RR-С„РѕСЂРјР°С‚Р°         */
    TXT.STR_TXT.DLNOP[1] = 2;
  }
  else
  {
    memcpy(TXT.STR_TXT.OPER, RX.BUF_OP_RX, 4); /* РґР»СЏ RX-С„РѕСЂРјР°С‚Р°         */
    TXT.STR_TXT.DLNOP[1] = 4;
  }
  memcpy(TXT.STR_TXT.POLE9, ESD.STR_ESD.POLE11, 8); /*С„РѕСЂРјРёСЂРѕРІ.РёРґРµРЅС‚РёС„РёРє.РїРѕР»СЏ */

  memcpy(OBJTEXT[ITCARD], TXT.BUF_TXT, 80); /*Р·Р°РїРёСЃСЊ РѕР±'РµРєС‚РЅРѕР№ РєР°СЂС‚С‹  */


  ITCARD += 1; /*РєРѕСЂСЂРµРєС†.РёРЅРґ-СЃР° СЃРІРѕР±.Рє-С‚С‹*/

  if (ARG == 3)
  {
    CHADR = CHADR + 2; // H in SDC
  }
  else
  {
    CHADR = CHADR + ARG; /*РєРѕСЂСЂРµРєС†.СЃС‡РµС‚С‡РёРєР° Р°РґСЂРµСЃР° */
  }

  return;
}

int SDC() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DC    */
{
  char *RAB; /*СЂР°Р±РѕС‡Р°СЏ РїРµСЂРµРјРµРЅРЅР°СЏ      */

  RX.OP_RX.OP = 0;                                  /*Р·Р°РЅСѓР»РёРј РґРІР° СЃС‚Р°СЂС€РёС…     */
  RX.OP_RX.R1X2 = 0;                                /*Р±Р°Р№С‚Р° RX.OP_RX          */
  if (                                              /* РµСЃР»Рё РѕРїРµСЂР°РЅРґ РЅР°С‡РёРЅР°РµС‚СЃСЏ*/
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /* СЃ РєРѕРјР±РёРЅР°С†РёРё           */
              "F'", 2)                              /* F',                    */
      )                                             /* С‚Рѕ                     */
  {
    RAB = strtok                                           /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.RAB   */
        (                                                  /*РІС‹Р±РёСЂР°РµРј РїРµСЂРІСѓСЋ Р»РµРєСЃРµРјСѓ */
         (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND + 2, /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
         "'"                                               /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
        );

    RX.OP_RX.B2D2 = atoi(RAB);    /*РїРµСЂРµРІРѕРґ ASCII-> int     */
    RAB = (char *)&RX.OP_RX.B2D2; /*РїСЂРёРІРµРґРµРЅРёРµ Рє СЃРѕРіР»Р°С€РµРЅРёСЏРј*/
    swab(RAB, RAB, 2);            /* Р•РЎ Р­Р’Рњ                 */
  }
  else if (!memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, "H'", 2))
  {
    RR.OP_RR.OP = 0; /*Р·Р°РЅСѓР»РёРј РґРІР° СЃС‚Р°СЂС€РёС…     */
    RR.OP_RR.R1R2 = 0;

    RAB = strtok((char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND + 2, "'");

    short value = (short)atoi(RAB); /*16-Р±РёС‚РЅРѕРµ Р·РЅР°С‡РµРЅРёРµ*/
    RR.OP_RR.R1R2 = value;          /*Р·Р°РїРёСЃС‹РІР°РµРј РєР°Рє 32-Р±РёС‚Р°, РјР»Р°РґС€РёРµ 16 Р·Р°РїРѕР»РЅСЏСЋС‚СЃСЏ*/
    STXT(2);

    return 0;
  }
  else          /*РёРЅР°С‡Рµ                   */
    return (1); /*СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ     */

  STXT(4); /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ TXT-РєР°СЂС‚С‹  */

  return (0); /*СѓСЃРїРµС€РЅ.Р·Р°РІРµСЂС€РµРЅРёРµ РїРѕРґРїСЂ.*/
}
/*..........................................................................*/
int SDS() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.DS    */
{

  RX.OP_RX.OP = 0;                                   /*Р·Р°РЅСѓР»РёРј РґРІР° СЃС‚Р°СЂС€РёС…     */
  RX.OP_RX.R1X2 = 0;                                 /*Р±Р°Р№С‚Р° RX.OP_RX          */
  if (                                               /* РµСЃР»Рё РѕРїРµСЂР°РЅРґ РЅР°С‡РёРЅР°РµС‚СЃСЏ*/
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'F' /* СЃ РєРѕРјР±РёРЅР°С†РёРё F'        */
      )                                              /* С‚Рѕ:                    */
    RX.OP_RX.B2D2 = 0;                               /*Р·Р°РЅСѓР»РёРј RX.OP_RX.B2D2   */
  else if (
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] == 'H')
  {
    RR.OP_RR.OP = 0; /*Р·Р°РЅСѓР»РёРј РґРІР° СЃС‚Р°СЂС€РёС…     */
    RR.OP_RR.R1R2 = 0;
    STXT(2);
    return (0); /*СѓСЃРїРµС€РЅРѕ Р·Р°РІРµСЂС€РёС‚СЊ РїРѕРґРїСЂ.*/
  }
  else          /*РёРЅР°С‡Рµ                   */
    return (1); /*СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ     */

  STXT(4); /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ TXT-РєР°СЂС‚С‹  */

  return (0); /*СѓСЃРїРµС€РЅРѕ Р·Р°РІРµСЂС€РёС‚СЊ РїРѕРґРїСЂ.*/
}
/*..........................................................................*/
int SEND() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.END   */
{
  /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ            */
  memcpy(                    /*РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅРіРѕ РїРѕР»СЏ  */
         END.STR_END.POLE9,  /* END - РєР°СЂС‚С‹            */
         ESD.STR_ESD.POLE11, /*                        */
         8                   /*                        */
  );                         /*                        */
  memcpy(                    /*Р·Р°РїРёСЃСЊ РѕР±'РµРєС‚РЅРѕР№ РєР°СЂС‚С‹  */
         OBJTEXT[ITCARD],    /* РІ                      */
         END.BUF_END,        /* РјР°СЃСЃРёРІ                 */
         80                  /* РѕР±'РµРєС‚РЅС‹С…              */
  );                         /* РєР°СЂС‚                   */
  ITCARD += 1;               /*РєРѕСЂСЂРµРєС†.РёРЅРґ-СЃР° СЃРІРѕР±.Рє-С‚С‹*/
  return (100);              /*РІС‹С…РѕРґ СЃ РїСЂРёР·РЅ.РєРѕРЅС†Р° 2-РіРѕ*/
                             /*РїСЂРѕСЃРјРѕС‚СЂР°               */
}
/*..........................................................................*/
int SEQU() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.EQU   */
{
  return (0); /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂ.  */
}
/*..........................................................................*/
int SSTART() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.START */
{
  char *PTR;    /*РЅР°Р±РѕСЂ                   */
  char *METKA;  /*СЂР°Р±РѕС‡РёС…                 */
  char *METKA1; /*РїРµСЂРµРјРµРЅРЅС‹С…              */
  int J;        /*РїРѕРґРїСЂРѕРіСЂР°РјРјС‹            */
  int RAB;      /*                        */

  METKA1 = strtok                                  /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.METKA1*/
      (                                            /*РІС‹Р±РёСЂР°РµРј РїРµСЂРІСѓСЋ Р»РµРєСЃРµРјСѓ */
       (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.METKA, /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
       " "                                         /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
      );
  for (J = 0; J <= ITSYM; J++) /* РІСЃРµ РјРµС‚РєРё РёСЃС….С‚РµРєСЃС‚Р° РІ */
  {                            /* С‚Р°Р±Р». T_SYM СЃСЂР°РІРЅРёРІР°РµРј */
                               /* СЃРѕ Р·РЅР°С‡.РїРµСЂРµРј. *METKA1 */
    METKA = strtok(
        (char *)T_SYM[J].IMSYM, " ");
    if (!strcmp(METKA, METKA1))          /* Рё РїСЂРё СЃРѕРІРїР°РґРµРЅРёРё:      */
    {                                    /*  Р±РµСЂРµРј СЂР°Р·РЅРѕСЃС‚СЊ СЃС‡.Р°РґСЂ.*/
      RAB = CHADR - T_SYM[J].ZNSYM;      /*  Р·РЅР°С‡.СЌС‚РѕР№ РјРµС‚РєРё, РѕР±СЂР°-*/
      PTR = (char *)&RAB;                /*  Р·СѓСЏ РґР»РёРЅСѓ РїСЂРѕРіСЂР°РјРјС‹ РІ */
      swab(PTR, PTR, 2);                 /*  СЃРѕРіР»Р°С€РµРЅРёСЏС… Р•РЎ Р­Р‘Рњ, Рё */
      ESD.STR_ESD.DLPRG[0] = 0;          /*  Р·Р°РїРёСЃС‹РІ.РµРµ РІ ESD-РєР°СЂС‚Сѓ*/
      ESD.STR_ESD.DLPRG[1] = *PTR;       /*  РїРѕР±Р°Р№С‚РЅРѕ              */
      ESD.STR_ESD.DLPRG[2] = *(PTR + 1); /*                        */
      CHADR = T_SYM[J].ZNSYM;            /*СѓСЃС‚Р°РЅР°РІР».CHADR, СЂР°РІРЅС‹Рј  */
      /*РѕРїРµСЂР°РЅРґСѓ РѕРїРµСЂР°С‚.START   */
      /*РёСЃС…РѕРґРЅРѕРіРѕ С‚РµРєСЃС‚Р°        */
      PTR = (char *)&CHADR;              /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РїРѕР»СЏ ADPRG */
      ESD.STR_ESD.ADPRG[2] = *PTR;       /*ESD-РєР°СЂС‚С‹ РІ С„РѕСЂРјР°С‚Рµ     */
      ESD.STR_ESD.ADPRG[1] = *(PTR + 1); /*РґРІРѕРёС‡РЅРѕРіРѕ С†РµР»РѕРіРѕ        */
      ESD.STR_ESD.ADPRG[0] = '\x00';     /*РІ СЃРѕРіР»Р°С€РµРЅРёСЏС… Р•РЎ Р­Р’Рњ    */
      memcpy(                            /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ            */
             ESD.STR_ESD.IMPR,           /* РёРјРµРЅРё РїСЂРѕРіСЂР°РјРјС‹        */
             METKA,                      /*  Рё                     */
             strlen(METKA)               /*                        */
      );                                 /*                        */
      memcpy(                            /*РёРґРµРЅС‚РёС„РёРєР°С†РёРѕРЅРЅРіРѕ РїРѕР»СЏ  */
             ESD.STR_ESD.POLE11,         /* ESD - РєР°СЂС‚С‹            */
             METKA,                      /*                        */
             strlen(METKA)               /*                        */
      );                                 /*                        */
      memcpy(                            /*Р·Р°РїРёСЃСЊ РѕР±'РµРєС‚РЅРѕР№ РєР°СЂС‚С‹  */
             OBJTEXT[ITCARD],            /* РІ                      */
             ESD.BUF_ESD,                /* РјР°СЃСЃРёРІ                 */
             80                          /* РѕР±'РµРєС‚РЅС‹С…              */
      );                                 /* РєР°СЂС‚                   */
      ITCARD += 1;                       /*РєРѕСЂСЂРµРєС†.РёРЅРґ-СЃР° СЃРІРѕР±.Рє-С‚С‹*/
      return (0);                        /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂРѕРіСЂ*/
    }
  }
  return (2); /*РѕС€РёР±РѕС‡РЅРѕРµ Р·Р°РІРµСЂС€.РїСЂРѕРіСЂ. */
}
/*..........................................................................*/
int SUSING() /*РїРѕРґРїСЂ.РѕР±СЂ.РїСЃ.РѕРїРµСЂ.USING */
{
  /*РЅР°Р±РѕСЂ                   */
  char *METKA;                                       /*СЂР°Р±РѕС‡РёС…                 */
  char *METKA1;                                      /*РїРµСЂРµРјРµРЅРЅС‹С…              */
  char *METKA2;                                      /*                        */
  int J = 0;                                             /*                        */
  int NBASRG;                                        /*                        */
  METKA1 = strtok                                    /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.METKA1*/
      (                                              /*РІС‹Р±РёСЂР°РµРј РїРµСЂРІСѓСЋ Р»РµРєСЃРµРјСѓ */
       (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
       ","                                           /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
      );
  METKA2 = strtok /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.METKA2*/
      (           /*РІС‹Р±РёСЂР°РµРј РІС‚РѕСЂСѓСЋ Р»РµРєСЃРµРјСѓ */
       NULL,      /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
       " "        /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
      );
  if (isalpha((int)*METKA2) || *METKA2 == '@') /*РµСЃР»Рё Р»РµРєСЃРµРјР° РЅР°С‡РёРЅР°РµС‚СЃСЏ */
  {                          /*СЃ Р±СѓРєРІС‹, С‚Рѕ:            */

    for (J = 0; J <= ITSYM; J++) /* РІСЃРµ РјРµС‚РєРё РёСЃС….С‚РµРєСЃС‚Р° РІ */
    {                            /* С‚Р°Р±Р». T_SYM СЃСЂР°РІРЅРёРІР°РµРј */
      /* СЃРѕ Р·РЅР°С‡.РїРµСЂРµРј. *METKA2 */
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA2))              /* Рё РїСЂРё СЃРѕРІРїР°РґРµРЅРёРё:      */
      {                                        /*  Р·Р°РїРѕРјРёРЅР°РµРј Р·РЅР°С‡РµРЅРёРµ   */
        if ((NBASRG = T_SYM[J].ZNSYM) <= 0x0f) /*  РјРµС‚РєРё РІ NBASRG Рё РІ СЃР».*/
          goto SUSING1;                        /*  NBASRG <= 0x0f РёРґРµРј РЅР°*/
                                               /*  СѓСЃС‚Р°РЅ.СЂРµРіРёСЃС‚СЂР° Р±Р°Р·С‹   */
        else                                   /* РёРЅР°С‡Рµ:                 */
          return (6);                          /*  СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ   */
      }
    }
    return (2); /*Р·Р°РІРµСЂС€.РїРѕРґРїСЂ.РїРѕ РѕС€РёР±РєРµ  */
  }
  else                                     /*РёРЅР°С‡Рµ, РµСЃР»Рё РІС‚РѕСЂРѕР№ РѕРїРµСЂ.*/
  {                                        /*РЅР°С‡РёРЅР°РµС‚СЃСЏ СЃ С†РёС„СЂС‹, С‚Рѕ: */
    NBASRG = atoi(METKA2);                 /* Р·Р°РїРѕРјРЅРёРј РµРіРѕ РІ NBASRG  */
    if ((NBASRG = T_SYM[J].ZNSYM) <= 0x0f) /* Рё,РµСЃР»Рё РѕРЅ <= 0x0f,С‚Рѕ:  */
      goto SUSING1;                        /* РёРґРµРј РЅР° СѓСЃС‚Р°РЅ.СЂРµРі.Р±Р°Р·С‹ */
    else                                   /*РёРЅР°С‡Рµ:                  */
      return (6);                          /* СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ    */
  }

SUSING1: /*СѓСЃС‚Р°РЅРѕРІРёС‚СЊ Р±Р°Р·РѕРІС‹Р№ СЂРµРі. */

  T_BASR[NBASRG - 1].PRDOST = 'Y'; /* РІР·РІРµСЃС‚Рё РїСЂРёР·РЅ.Р°РєС‚РёРІРЅ.  */
  if (*METKA1 == '*')              /* РµСЃР»Рё РїРµСЂРІ.РѕРї-РЅРґ == '*',*/
  {
    T_BASR[NBASRG - 1].SMESH = CHADR; /* РІС‹Р±РёСЂ.Р·РЅР°С‡.Р±Р°Р·С‹ ==CHADR*/
  }
  else /*РёРЅР°С‡Рµ:                  */
  {
    for (J = 0; J <= ITSYM; J++) /* РІСЃРµ РјРµС‚РєРё РёСЃС….С‚РµРєСЃС‚Р° РІ */
    {                            /* С‚Р°Р±Р». T_SYM СЃСЂР°РІРЅРёРІР°РµРј */
      /* СЃРѕ Р·РЅР°С‡.РїРµСЂРµРј. *METKA1 */
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA1))                  /* Рё РїСЂРё СЃРѕРІРїР°РґРµРЅРёРё:      */
      {                                            /*  Р±РµСЂРµРј Р·РЅР°С‡РµРЅРёРµ СЌС‚РѕР№   */
        T_BASR[NBASRG - 1].SMESH = T_SYM[J].ZNSYM; /*  СЌС‚РѕР№ РјРµС‚РєРё РєР°Рє Р±Р°Р·Сѓ   */
      }
    }
    return (2); /*Р·Р°РІРµСЂС€РµРЅРёРµ РїСЂРѕРіСЂ.РїРѕ РѕС€РёР±*/
  }
  return (0); /*СѓСЃРїРµС€РЅРѕРµ Р·Р°РІРµСЂС€.РїРѕРґРїСЂРѕРіСЂ*/
}
/*..........................................................................*/
int SRR() /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RR-С„РѕСЂРј. */
{
  char *METKA;                   /*РЅР°Р±РѕСЂ                   */
  char *METKA1;                  /*СЂР°Р±РѕС‡РёС…                 */
  char *METKA2;                  /*РїРµСЂРµРјРµРЅРЅС‹С…              */
  unsigned char R1R2;            /*                        */
  int J;                         /*                        */
  RR.OP_RR.OP = T_MOP[I3].CODOP; /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РєРѕРґР° РѕРїРµСЂР°С†*/

  METKA1 = strtok                                    /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.METKA1*/
      (                                              /*РІС‹Р±РёСЂР°РµРј РїРµСЂРІСѓСЋ Р»РµРєСЃРµРјСѓ */
       (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
       ","                                           /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
      );

  METKA2 = strtok /*РІ РїРµСЂРµРј. c СѓРєР°Р·Р°С‚.METKA2*/
      (           /*РІС‹Р±РёСЂР°РµРј РІС‚РѕСЂСѓСЋ Р»РµРєСЃРµРјСѓ */
       NULL,      /*РѕРїРµСЂР°РЅРґР° С‚РµРєСѓС‰РµР№ РєР°СЂС‚С‹  */
       " "        /*РёСЃС….С‚РµРєСЃС‚Р° РђРЎРЎР•РњР‘Р›Р•Р Рђ   */
      );

  if (isalpha((int)*METKA1) || *METKA1 == '@')     /*РµСЃР»Рё Р»РµРєСЃРµРјР° РЅР°С‡РёРЅР°РµС‚СЃСЏ */
  {                              /*СЃ Р±СѓРєРІС‹, С‚Рѕ:            */
    for (J = 0; J <= ITSYM; J++) /* РІСЃРµ РјРµС‚РєРё РёСЃС….С‚РµРєСЃС‚Р° РІ */
    {                            /* С‚Р°Р±Р». T_SYM СЃСЂР°РІРЅРёРІР°РµРј */
      /* СЃРѕ Р·РЅР°С‡.РїРµСЂРµРј. *METKA1 */
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA1))   /* Рё РїСЂРё СЃРѕРІРїР°РґРµРЅРёРё:      */
      {                             /*  Р±РµСЂРµРј Р·РЅР°С‡РµРЅРёРµ СЌС‚РѕР№   */
        R1R2 = T_SYM[J].ZNSYM << 4; /*  РјРµС‚РєРё РІ РєР°С‡РµСЃС‚РІРµ РїРµСЂРІ.*/
        goto SRR1;
      } /*  РѕРїСЂРµСЂР°РЅРґР° РјР°С€РёРЅРЅРѕР№ РєРѕРј*/
    }
    return (2); /*СЃРѕРѕР±С‰."РЅРµРѕР±'СЏРІР».РёРґРµРЅС‚РёС„"*/
  }
  else                        /*РёРЅР°С‡Рµ, Р±РµСЂРµРј РІ РєР°С‡РµСЃС‚РІРµ */
  {                           /*РїРµСЂРІ.РѕРїРµСЂР°РЅРґР° РјР°С€РёРЅРЅ.РєРѕРј*/
    R1R2 = atoi(METKA1) << 4; /*Р·РЅР°С‡РµРЅ.РІС‹Р±СЂ.   Р»РµРєСЃРµРјС‹  */
  }

SRR1:

  if (isalpha((int)*METKA2) || *METKA2 == '@')     /*РµСЃР»Рё Р»РµРєСЃРµРјР° РЅР°С‡РёРЅР°РµС‚СЃСЏ */
  {                              /*СЃ Р±СѓРєРІС‹, С‚Рѕ:            */
    for (J = 0; J <= ITSYM; J++) /* РІСЃРµ РјРµС‚РєРё РёСЃС….С‚РµРєСЃС‚Р° РІ */
    {                            /* С‚Р°Р±Р». T_SYM СЃСЂР°РІРЅРёРІР°РµРј */
      /* СЃРѕ Р·РЅР°С‡.РїРµСЂРµРј. *РњР•РўРљРђ2 */
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA2))     /* Рё РїСЂРё СЃРѕРІРїР°РґРµРЅРёРё:      */
      {                               /*  Р±РµСЂРµРј Р·РЅР°С‡РµРЅРёРµ СЌС‚РѕР№   */
        R1R2 = R1R2 + T_SYM[J].ZNSYM; /*  РјРµС‚РєРё РІ РєР°С‡РµСЃС‚РІРµ РІС‚РѕСЂ.*/
        goto SRR2;                    /*                        */
      } /*  РѕРїСЂРµСЂР°РЅРґР° РјР°С€РёРЅРЅРѕР№ РєРѕРј*/
    } /*                        */
    return (2); /*СЃРѕРѕР±С‰."РЅРµРѕР±'СЏРІР».РёРґРµРЅС‚РёС„"*/
  }
  else                          /*РёРЅР°С‡Рµ, Р±РµСЂРµРј РІ РєР°С‡РµСЃС‚РІРµ */
  {                             /*РІС‚РѕСЂ.РѕРїРµСЂР°РЅРґР° РјР°С€РёРЅРЅ.РєРѕРј*/
    R1R2 = R1R2 + atoi(METKA2); /*Р·РЅР°С‡РµРЅ.РІС‹Р±СЂ.   Р»РµРєСЃРµРјС‹  */
  }

SRR2:

  RR.OP_RR.R1R2 = R1R2; /*С„РѕСЂРјРёСЂСѓРµРј РѕРїРµСЂ-РґС‹ РјР°С€-РѕР№*/
                        /*РєРѕРјР°РЅРґС‹                 */

  STXT(2);
  return (0); /*РІС‹Р№С‚Рё РёР· РїРѕРґРїСЂРѕРіСЂР°РјРјС‹   */
}

/*..........................................................................*/

int SRX() /*РїРѕРґРїСЂ.РѕР±СЂ.РѕРїРµСЂ.RX-С„РѕСЂРј. */
{
  char *METKA2;
  char *METKA1;
  char *METKA; /* РќР°Р±РѕСЂ СЂР°Р±РѕС‡РёС… РїРµСЂРµРјРµРЅРЅС‹С… */
  char *PTR;
  int DELTA;          /*                        */
  int ZNSYM;          /*                        */
  int NBASRG;         /*                        */
  int J;              /*                        */
  int I;              /*                        */
  unsigned char R1X2; /*                        */
  int B2D2;           /*                        */

  RX.OP_RX.OP = T_MOP[I3].CODOP; /* С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РєРѕРґР° РѕРїРµСЂР°С†*/

  METKA1 = strtok(
      (char *)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,
      ",");

  METKA2 = strtok(
      NULL,
      " ");

  if (isalpha((int)*METKA1) || *METKA1 == '@')
  {
    for (J = 0; J <= ITSYM; J++)
    {
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA1))
      {
        R1X2 = T_SYM[J].ZNSYM << 4;
        goto SRX1;
      }
    }
    return (2);
  }
  else
  {
    R1X2 = atoi(METKA1) << 4;
  }

SRX1:

  if (isalpha((int)*METKA2) || isdigit((int)*METKA2) || *METKA2 == '@') /* Р•СЃР»Рё РІС‚РѕСЂРѕР№ РѕРїРµСЂР°РЅРґ вЂ” РјРµС‚РєР° */
  {
    for (J = 0; J <= ITSYM; J++) /* РЎСЂР°РІРЅРёРІР°РµРј СЃРѕ РІСЃРµРјРё РјРµС‚РєР°РјРё */
    {
      METKA = strtok(
          (char *)T_SYM[J].IMSYM, " ");
      if (!strcmp(METKA, METKA2))
      {
        NBASRG = 0;
        DELTA = 0xfff - 1;
        ZNSYM = T_SYM[J].ZNSYM;

        for (I = 0; I < 15; I++)
        {
          if (
              T_BASR[I].PRDOST == 'Y' &&
              ZNSYM - T_BASR[I].SMESH >= 0 &&
              ZNSYM - T_BASR[I].SMESH < DELTA)
          {
            NBASRG = I + 1;
            DELTA = ZNSYM - T_BASR[I].SMESH;
          }
        }

        if (NBASRG == 0 || DELTA > 0xfff)
        {
          return (5);
        }
        else
        {
          B2D2 = NBASRG << 12;
          B2D2 = B2D2 + DELTA;
          PTR = (char *)&B2D2;
          swab(PTR, PTR, 2);
          RX.OP_RX.B2D2 = B2D2;
        }
        goto SRX2;
      }
    }

    // init
    if (isdigit((int)*METKA2))
    {
      RX.OP_RX.R1X2 = R1X2;

      B2D2 = (METKA2[0] - '0');
      PTR = (char *)&B2D2;
      swab(PTR, PTR, 2);
      RX.OP_RX.B2D2 = B2D2;

      STXT(4);    /* Р¤РѕСЂРјРёСЂРѕРІР°РЅРёРµ TXT-РєР°СЂС‚С‹ */
      return (0); /* Р’С‹С…РѕРґ РёР· РїРѕРґРїСЂРѕРіСЂР°РјРјС‹ */
    }

    return (2);
  }
  else
  {
    return (4);
  }

SRX2:
  RX.OP_RX.R1X2 = R1X2; /* Р”РѕР·Р°РїРёСЃСЊ РїРµСЂРІРѕРіРѕ РѕРїРµСЂР°РЅРґР° */

  STXT(4);    /* Р¤РѕСЂРјРёСЂРѕРІР°РЅРёРµ TXT-РєР°СЂС‚С‹ */
  return (0); /* Р’С‹С…РѕРґ РёР· РїРѕРґРїСЂРѕРіСЂР°РјРјС‹ */
}

/*..........................................................................*/
int SOBJFILE()                              /*РїРѕРґРїСЂРѕРіСЂ.С„РѕСЂРјРёСЂ.РѕР±'РµРєРЅ. */
{                                           /*С„Р°Р№Р»Р°                   */
  FILE *fp;                                 /*РЅР°Р±РѕСЂ СЂР°Р±РѕС‡РёС…           */
  int RAB2;                                 /*РїРµСЂРµРјРµРЅРЅС‹С…              */
                                            /*С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ РїСѓС‚Рё Рё РёРјРµ-*/
  strcat(NFIL, "tex");                      /*РЅРё РѕР±'РµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°     */
  if ((fp = fopen(NFIL, "wb")) == NULL)     /*РїСЂРё РЅРµСѓРґР°С‡РЅ.РѕС‚РєСЂС‹С‚.С„-Р»Р° */
    return (-7);                            /* СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ    */
  else                                      /*РёРЅР°С‡Рµ:                  */
    RAB2 = fwrite(OBJTEXT, 80, ITCARD, fp); /* С„РѕСЂРјРёСЂСѓРµРј С‚РµР»Рѕ РѕР±.С„Р°Р№Р»Р°*/
  fclose(fp);                               /*Р·Р°РєСЂС‹РІР°РµРј РѕР±'РµРєС‚РЅС‹Р№ С„Р°Р№Р»*/
  return (RAB2);                            /*Р·Р°РІРµСЂС€Р°РµРј  РїРѕРґРїСЂРѕРіСЂР°РјРјСѓ */
}
/*..........................................................................*/
void INITUNION()
{

  /*
  ***** Рё РЅ Рё С† Рё Р° Р» Рё Р· Р° С† Рё СЏ   РїРѕР»РµР№ Р±СѓС„РµСЂР° С„РѕСЂРјРёСЂРѕРІР°РЅРёСЏ Р·Р°РїРёСЃРµР№ ESD-С‚РёРїР°
  *****                             РґР»СЏ РІС‹С…РѕРґРЅРѕРіРѕ РѕР±СЉРµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°
  */

  ESD.STR_ESD.POLE1 = 0x02;
  memcpy(ESD.STR_ESD.POLE2, "ESD", 3);
  memset(ESD.STR_ESD.POLE3, 0x40, 6);
  ESD.STR_ESD.POLE31[0] = 0x00;
  ESD.STR_ESD.POLE31[1] = 0x10;
  memset(ESD.STR_ESD.POLE32, 0x40, 2);
  ESD.STR_ESD.POLE4[0] = 0x00;
  ESD.STR_ESD.POLE4[1] = 0x01;
  memset(ESD.STR_ESD.IMPR, 0x40, 8);
  ESD.STR_ESD.POLE6 = 0x00;
  memset(ESD.STR_ESD.ADPRG, 0x00, 3);
  ESD.STR_ESD.POLE8 = 0x40;
  memset(ESD.STR_ESD.DLPRG, 0x00, 3);
  memset(ESD.STR_ESD.POLE10, 0x40, 40);
  memset(ESD.STR_ESD.POLE11, 0x40, 8);

  /*
  ***** Рё РЅ Рё С† Рё Р° Р» Рё Р· Р° С† Рё СЏ   РїРѕР»РµР№ Р±СѓС„РµСЂР° С„РѕСЂРјРёСЂРѕРІР°РЅРёСЏ Р·Р°РїРёСЃРµР№ TXT-С‚РёРїР°
  *****                             РґР»СЏ РІС‹С…РѕРґРЅРѕРіРѕ РѕР±СЉРµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°
  */

  TXT.STR_TXT.POLE1 = 0x02;
  memcpy(TXT.STR_TXT.POLE2, "TXT", 3);
  TXT.STR_TXT.POLE3 = 0x40;
  memset(TXT.STR_TXT.ADOP, 0x00, 3);
  memset(TXT.STR_TXT.POLE5, 0x40, 2);
  memset(TXT.STR_TXT.DLNOP, 0X00, 2);
  memset(TXT.STR_TXT.POLE7, 0x40, 2);
  TXT.STR_TXT.POLE71[0] = 0x00;
  TXT.STR_TXT.POLE71[1] = 0x01;
  memset(TXT.STR_TXT.OPER, 0x40, 56);
  memset(TXT.STR_TXT.POLE9, 0x40, 8);

  /*
  ***** Рё РЅ Рё С† Рё Р° Р» Рё Р· Р° С† Рё СЏ   РїРѕР»РµР№ Р±СѓС„РµСЂР° С„РѕСЂРјРёСЂРѕРІР°РЅРёСЏ Р·Р°РїРёСЃРµР№ END-С‚РёРїР°
  *****                             РґР»СЏ РІС‹С…РѕРґРЅРѕРіРѕ РѕР±СЉРµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°
  */

  END.STR_END.POLE1 = 0x02;
  memcpy(END.STR_END.POLE2, "END", 3);
  memset(END.STR_END.POLE3, 0x40, 68);
  memset(END.STR_END.POLE9, 0x40, 8);
}

/*..........................................................................*/

int actual_lines = 0;

int main(int argc, char **argv) /*РіР»Р°РІРЅР°СЏ РїСЂРѕРіСЂР°РјРјР°       */
{
  FILE *fp;
  char *ptr = argv[1];
  unsigned char ASSTEXT[DL_ASSTEXT][80];

  /*
  ******* Р‘ Р› Рћ Рљ  РѕР±'СЏРІР»РµРЅРёР№ СЂР°Р±РѕС‡РёС… РїРµСЂРµРјРµРЅРЅС‹С…
  */

  int I1, I2, RAB; /* РїРµСЂРµРјРµРЅРЅС‹Рµ С†РёРєР»Р°      */

  INITUNION(); /* РЅР°С‡Р°Р»СЊРЅРѕРµ Р·Р°РїРѕР»РЅРµРЅРёРµ  */
               /* Р±СѓС„РµСЂРѕРІ С„РѕСЂРјРёСЂРѕРІР°РЅРёСЏ  */
               /* Р·Р°РїРёСЃРµР№ РІС‹С…РѕРґРЅРѕРіРѕ РѕР±СЉ-*/
               /* РµРєС‚РЅРѕРіРѕ  С„Р°Р№Р»Р°        */

  /*
  ******       Рќ Рђ Р§ Рђ Р› Рћ   Рџ Р• Р  Р’ Рћ Р“ Рћ  Рџ Р  Рћ РЎ Рњ Рћ Рў Р  Рђ      *****
  */
  /*
  ***** Р‘ Р› Рћ Рљ  РёРЅРёС†РёР°Р»РёР·Р°С†РёРё РјР°СЃСЃРёРІР° ASSTEXT, Р·Р°РјРµРЅСЏСЋС‰РёР№ РёРЅРёС†-СЋ РІ РѕР±'СЏРІР»РµРЅРёРё
  *****          (РІРІРµРґРµРЅ РєР°Рє СЂРµР°РєС†РёСЏ РЅР° С‚СЂРµР±РѕРІР°РЅРёСЏ BORLANDC++ 2.0)
  */

  strcpy(NFIL, ptr);

  if (argc != 2)

  {
    printf("%s\n", "РћС€РёР±РєР° РІ РєРѕРјР°РЅРґРЅРѕР№ СЃС‚СЂРѕРєРµ");
    return 1;
  }

  if (strcmp(&NFIL[strlen(NFIL) - 3], "ass"))

  {
    printf("%s\n", "РќРµРІРµСЂРЅС‹Р№ С‚РёРї С„Р°Р№Р»Р° СЃ РёСЃС…РѕРґРЅС‹Рј С‚РµРєСЃС‚РѕРј");
    return 1;
  }

  else

  {
    if ((fp = fopen(NFIL, "rb")) == NULL) /*РїСЂРё РЅРµСѓРґР°С‡РЅ.РѕС‚РєСЂС‹С‚.С„-Р»Р° */
                                          /* СЃРѕРѕР±С‰РµРЅРёРµ РѕР± РѕС€РёР±РєРµ    */
    {
      printf("%s\n", "РќРµ РЅР°Р№РґРµРЅ С„Р°Р№Р» СЃ РёСЃС…РѕРґРЅС‹Рј С‚РµРєСЃС‚РѕРј");
      return 1;
    }

    else

    {
      for (I1 = 0; I1 <= DL_ASSTEXT; I1++)

      {
        if (!fread(ASSTEXT[I1], 80, 1, fp))
        {
          if (feof(fp))
            goto main1;
          else
          {
            printf("%s\n", "РћС€РёР±РєР° РїСЂРё С‡С‚РµРЅРёРё С„Р°Р№Р»Р° СЃ РёСЃС….С‚РµРєСЃС‚РѕРј");
            return 1;
          }
        }

        int i;
        /*for (i = 0; i < 80; i++)
        {
          if (ASSTEXT[I1][i] == '@')
          {
            int spaceIndex = -1;
            int j;
            for (j = i + 1; j < 80; j++)
            {
              if (ASSTEXT[I1][j] == ' ')
              {
                spaceIndex = j;
                break;
              }
            }
            if (spaceIndex != -1)
            {
              int j;
              for (j = i; j < 79; j++)
              {
                ASSTEXT[I1][j] = ASSTEXT[I1][j + 1];
              }
              int j2;
              for (j2 = 79; j2 > spaceIndex; j2--)
              {
                ASSTEXT[I1][j2] = ASSTEXT[I1][j2 - 1];
              }
              ASSTEXT[I1][spaceIndex + 1] = ' ';
              ASSTEXT[I1][79] = '\0';
            }
          }
        }*/
      }

      printf("%s\n", "РџРµСЂРµРїРѕР»РЅРµРЅРёРµ Р±СѓС„РµСЂР° С‡С‚РµРЅРёСЏ РёСЃС….С‚РµРєСЃС‚Р°");
      return 1;
    }
  }

main1:
  fclose(fp);
  NFIL[strlen(NFIL) - 3] = '\x0';

  /*
  ***** Рљ Рћ Рќ Р• Р¦ Р±Р»РѕРєР° РёРЅРёС†РёР°Р»РёР·Р°С†РёРё
  */

  for (I1 = 0; I1 < DL_ASSTEXT; I1++)        /*РґР»СЏ РєР°СЂС‚ СЃ 1 РїРѕ РєРѕРЅРµС‡РЅСѓСЋ*/
  {                                          /*                        */
    memset(TEK_ISX_KARTA.BUFCARD, 0x40, 80); // РћС‡РёСЃС‚РєР° Р±СѓС„РµСЂР° РїСЂРѕР±РµР»Р°РјРё

    memcpy(TEK_ISX_KARTA.BUFCARD, ASSTEXT[I1], /*С‡-С‚СЊ РѕС‡РµСЂРµРґРЅ.РєР°СЂС‚Сѓ РІ Р±СѓС„*/
           80);                                /*                        */

    if (TEK_ISX_KARTA.STRUCT_BUFCARD.METKA[0] ==   /*РїРµСЂРµС…РѕРґ РїСЂРё РѕС‚СЃСѓС‚СЃС‚РІРёРё  */
        ' ')                                       /*РјРµС‚РєРё                   */
      goto CONT1;                                  /*РЅР° CONT1,               */
                                                   /*РёРЅР°С‡Рµ:                  */
    ITSYM += 1;                                    /* РїРµСЂРµС…РѕРґ Рє СЃР»РµРґ.СЃС‚СЂ.TSYM*/
    PRNMET = 'Y';                                  /* СѓСЃС‚Р°РЅ.РїСЂРёР·РЅ.РЅР°Р»РёС‡.РјРµС‚РєРё*/
    memcpy(T_SYM[ITSYM].IMSYM,                     /* Р·Р°РїРѕРјРЅРёС‚СЊ РёРјСЏ СЃРёРјРІРѕР»Р°  */
           TEK_ISX_KARTA.STRUCT_BUFCARD.METKA, 8); /* Рё                      */
    T_SYM[ITSYM].ZNSYM = CHADR;                    /* РµРіРѕ Р·РЅР°С‡РµРЅРёРµ(РѕС‚РЅ.Р°РґСЂ.) */


    /*
    ***** Р‘ Р› Рћ Рљ  РїРѕРёСЃРєР° С‚РµРєСѓС‰РµР№ РѕРїРµСЂР°С†РёРё СЃСЂРµРґРё РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёР№
    */

  CONT1:

    for (I2 = 0; I2 < NPOP; I2++)                      /*РґР»СЏ РІСЃРµС… СЃС‚СЂ.С‚Р°Р±.РїСЃ.РѕРїРµСЂ*/
    {                                                  /*РІС‹РїРѕР»РЅРёС‚СЊ СЃР»РµРґСѓС‰РµРµ:     */
      if (                                             /* РµСЃР»Рё                   */
          !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC, /* РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёСЏ         */
                  T_POP[I2].MNCPOP, 5)                 /* СЂР°СЃРїРѕР·РЅР°РЅР°,            */
          )                                            /* С‚Рѕ:                    */
                                                       /*                        */
      {
        switch (T_POP[I2].BXPROG()) /* СѓР№С‚Рё РІ РїРѕРґРїСЂ.РѕР±СЂР°Р±РѕС‚РєРё */
        {
        case 0:
          goto CONT2; /* Рё Р·Р°РІРµСЂС€РёС‚СЊ С†РёРєР»       */
        case 1:
          goto ERR1;
        case 100:
          goto CONT3;
        }
      } /*                        */
    } /*                        */

    for (I3 = 0; I3 < NOP; I3++)                       /*РґР»СЏ РІСЃРµС… СЃС‚СЂ.С‚Р°Р±.Рј.РѕРїРµСЂ.*/
    {                                                  /*РІС‹РїРѕР»РЅРёС‚СЊ СЃР»РµРґСѓСЋС‰РµРµ:    */
      if (                                             /* РµСЃР»Рё                   */
          !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC, /* РјР°С€РёРЅРЅР°СЏ РѕРїРµСЂР°С†РёСЏ      */
                  T_MOP[I3].MNCOP, 5)                  /* СЂР°СЃРїРѕР·РЅР°РЅР°,            */
          )                                            /* С‚Рѕ:                    */
                                                       /*                        */
      {
        T_MOP[I3].BXPROG(); /* СѓР№С‚Рё РІ РїРѕРґРїСЂ.РѕР±СЂР°Р±РѕС‚РєРё */
        PRNMET = 'N';       /* СЃРЅСЏС‚СЊ РїСЂРёР·РЅ.РЅР°Р»РёС‡.РјРµС‚РєРё*/
        goto CONT2;         /* Рё Р·Р°РІРµСЂС€РёС‚СЊ С†РёРєР»       */
      }
    }

    goto ERR3; /*СЃРѕРѕР±С‰.'РјРЅРµРјРѕРєРѕРґ РЅРµСЂР°СЃРї.'*/

  CONT2:
    continue; /*РєРѕРЅРµС† С†РёРєР»Р° РѕР±СЂР°Р±РѕС‚РєРё   */
  } /*РєР°СЂС‚ РёСЃС….С‚РµРєСЃС‚Р°         */

  /*
  ******       Рќ Рђ Р§ Рђ Р› Рћ   Р’ Рў Рћ Р  Рћ Р“ Рћ  Рџ Р  Рћ РЎ Рњ Рћ Рў Р  Рђ      *****
  */

CONT3:


  T_MOP[0].BXPROG = SRR; /*СѓСЃС‚Р°РЅРѕРІРёС‚СЊ СѓРєР°Р·Р°С‚РµР»Рё    */
  T_MOP[1].BXPROG = SRR; /*РЅР° РїРѕРґРїСЂРѕРіСЂР°РјРјС‹ РѕР±СЂР°Р±-РєРё*/
  T_MOP[2].BXPROG = SRX; /*РєРѕРјР°РЅРґ РђРЎРЎР•РњР‘Р›Р•Р Рђ РїСЂРё   */
  T_MOP[3].BXPROG = SRX; /*РІС‚РѕСЂРѕРј РїСЂРѕСЃРјРѕС‚СЂРµ        */
  T_MOP[4].BXPROG = SRX;
  T_MOP[5].BXPROG = SRX;

  T_MOP[6].BXPROG = SRX;
  T_MOP[7].BXPROG = SRX;
  T_MOP[8].BXPROG = SRX;
  T_MOP[9].BXPROG = SRX;
  T_MOP[10].BXPROG = SRX;

  T_POP[0].BXPROG = SDC;  /*СѓСЃС‚Р°РЅРѕРІРёС‚СЊ СѓРєР°Р·Р°С‚РµР»Рё    */
  T_POP[1].BXPROG = SDS;  /*РЅР° РїРѕРґРїСЂРѕРіСЂР°РјРјС‹ РѕР±СЂР°Р±-РєРё*/
  T_POP[2].BXPROG = SEND; /*РїСЃРµРІРґРѕРєРѕРјР°РЅРґ РђРЎРЎР•РњР‘Р›Р•Р Рђ */
  T_POP[3].BXPROG = SEQU; /*РїСЂРё РІС‚РѕСЂРѕРј РїСЂРѕСЃРјРѕС‚СЂРµ    */
  T_POP[4].BXPROG = SSTART;
  T_POP[5].BXPROG = SUSING;

  for (I1 = 0; I1 < DL_ASSTEXT; I1++) /*РґР»СЏ РєР°СЂС‚ СЃ 1 РїРѕ РєРѕРЅРµС‡РЅСѓСЋ*/
  {
    memset(TEK_ISX_KARTA.BUFCARD, 0x40, 80);

    memcpy(TEK_ISX_KARTA.BUFCARD, ASSTEXT[I1], /*С‡-С‚СЊ РѕС‡РµСЂРµРґРЅ.РєР°СЂС‚Сѓ РІ Р±СѓС„*/
           80);                                /*                        */

    /***** Р‘ Р› Рћ Рљ  РїРѕРёСЃРєР° С‚РµРєСѓС‰РµР№ РѕРїРµСЂР°С†РёРё СЃСЂРµРґРё РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёР№
     */

    for (I2 = 0; I2 < NPOP; I2++)                      /*РґР»СЏ РІСЃРµС… СЃС‚СЂ.С‚Р°Р±.РїСЃ.РѕРїРµСЂ*/
    {                                                  /*РІС‹РїРѕР»РЅРёС‚СЊ СЃР»РµРґСѓС‰РµРµ:     */
      if (                                             /* РµСЃР»Рё                   */
          !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC, /* РїСЃРµРІРґРѕРѕРїРµСЂР°С†РёСЏ         */
                  T_POP[I2].MNCPOP, 5)                 /* СЂР°СЃРїРѕР·РЅР°РЅР°,            */
          )                                            /* С‚Рѕ                     */
                                                       /*                        */
      {
        

        switch (T_POP[I2].BXPROG()) /* СѓР№С‚Рё РІ РїРѕРґРїСЂ.РѕР±СЂР°Р±РѕС‚РєРё */
        {
        case 0:
          goto CONT4; /* Рё Р·Р°РІРµСЂС€РёС‚СЊ С†РёРєР»       */
        case 100:     /*СѓР№С‚Рё РЅР° С„РѕСЂРјРёСЂРѕРІР°РЅРёРµ    */
          goto CONT5; /*РѕР±'РµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°        */
        }
      } /*                        */
    } /*                        */

    for (I3 = 0; I3 < NOP; I3++)                       /*РґР»СЏ РІСЃРµС… СЃС‚СЂ.С‚Р°Р±.Рј.РѕРїРµСЂ.*/
    {                                                  /*РІС‹РїРѕР»РЅРёС‚СЊ СЃР»РµРґСѓСЋС‰РµРµ:    */
      if (                                             /* РµСЃР»Рё                   */
          !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC, /* РјР°С€РёРЅРЅР°СЏ РѕРїРµСЂР°С†РёСЏ      */
                  T_MOP[I3].MNCOP, 5)                  /* СЂР°СЃРїРѕР·РЅР°РЅР°             */
          )                                            /* С‚Рѕ                     */
                                                       /*                        */
      {
        
        switch (T_MOP[I3].BXPROG()) /* СѓР№С‚Рё РІ РїРѕРґРїСЂ.РѕР±СЂР°Р±РѕС‚РєРё */
        {
        case 0:
          goto CONT4; /* Рё Р·Р°РІРµСЂС€РёС‚СЊ С†РёРєР»       */

        case 2:      /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡РµСЃРєРѕРµ  */
          goto ERR2; /*СЃРѕРѕР±С‰РµРЅРёРµ               */

        case 4:      /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡РµСЃРєРѕРµ  */
          goto ERR4; /*СЃРѕРѕР±С‰РµРЅРёРµ               */

        case 5:      /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡РµСЃРєРѕРµ  */
          goto ERR5; /*СЃРѕРѕР±С‰РµРЅРёРµ               */

        case 6:      /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡РµСЃРєРѕРµ  */
          goto ERR6; /*СЃРѕРѕР±С‰РµРЅРёРµ               */

        case 7:      /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡РµСЃРєРѕРµ  */
          goto ERR6; /*СЃРѕРѕР±С‰РµРЅРёРµ               */
        }
      }
    }

  CONT4:
    continue; /*РєРѕРЅРµС† С†РёРєР»Р° РѕР±СЂР°Р±РѕС‚РєРё   */
  } /*РєР°СЂС‚ РёСЃС….С‚РµРєСЃС‚Р°         */

CONT5:

  if (ITCARD == (RAB = SOBJFILE())) /*РµСЃР»Рё РІ РѕР±'РµРєС‚РЅС‹Р№ С„Р°Р№Р»   */
                                    /*РІС‹РІРµРґРµРЅС‹ РІСЃРµ РєР°СЂС‚С‹, С‚Рѕ: */
    printf                          /* СЃРѕРѕР±С€РµРЅРёРµ РѕР± СѓСЃРїРµС€РЅРѕРј  */
        (                           /* Р·Р°РІРµСЂС€РµРЅРёРё             */
         "%s\n",
         "СѓСЃРїРµС€РѕРµ Р·Р°РІРµСЂС€РµРЅРёРµ С‚СЂР°РЅСЃР»СЏС†РёРё");
  else /*РёРЅР°С‡Рµ:                  */
  {
    if (RAB == -7)
      goto ERR7;
    else
      printf       /* СЃРѕРѕР±С€РµРЅРёРµ Рѕ РЅРµСѓРґР°С‡РЅРѕРј  */
          (        /* С„СЂРјРёСЂРѕРІР°РЅРёРё РѕР±'РµРєС‚РЅРѕРіРѕ */
           "%s\n", /* С„Р°Р№Р»Р°                  */
           "РѕС€РёР±РєР° РїСЂРё С„РѕСЂРјРёСЂРѕРІР°РЅРёРё РѕР±СЉРµРєС‚РЅРѕРіРѕ С„Р°Р№Р»Р°");
  }
  return 1; /*Р·Р°РІРµСЂС€РёС‚СЊ main-РїСЂРѕРіСЂ.   */

ERR1:
  printf("%s\n", "er1"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰.РѕС€РёР±РєР° С„РѕСЂРјР°С‚Р° РґР°РЅРЅС‹С…*/
  goto CONT6;

ERR2:
  printf("%s\n", "er2"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РЅРµРѕР±СЉСЏРІР»РµРЅРЅС‹Р№ РёРґРµРЅС‚РёС„РёРєР°С‚РѕСЂ*/
  goto CONT6;

ERR3:
  printf("%s\n", "er3"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РѕС€РёР±РєР° РєРѕРґР° РѕРїРµСЂР°С†РёРё*/
  goto CONT6;

ERR4:
  printf("%s\n", "er4"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РѕС€РёР±РєР° РІС‚РѕСЂРѕРіРѕ РѕРїРµСЂР°РЅРґР°*/
  goto CONT6;

ERR5:
  printf("%s\n", "er5"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РѕС€РёР±РєР° Р±Р°Р·РёСЂРѕРІР°РЅРёСЏ*/
  goto CONT6;

ERR6:
  printf("%s\n", "er6"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РЅРµРґРѕРїСѓСЃС‚РёРјС‹Р№ РЅРѕРјРµСЂ СЂРµРіРёСЃС‚СЂР°*/
  goto CONT6;

ERR7:
  printf("%s\n", "er7"); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РѕС€РёР±РєР° РѕС‚РєСЂС‹С‚РёСЏ РѕР±СЉРµРєС‚РЅ.С„Р°Р№Р»Р°*/
  goto CONT6;

CONT6:
  printf("%s%d\n", "er in  ", I1 + 1); /*РІС‹РґР°С‚СЊ РґРёР°РіРЅРѕСЃС‚РёС‡.СЃРѕРѕР±С‰. РѕС€РёР±РєР° РІ РєР°СЂС‚Рµ N*/

  return 0;
} /*РєРѕРЅРµС† main-РїСЂРѕРіСЂР°РјРјС‹    */
